src/app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    if @account.save
---
INSERT INTO "accounts" ("first_name", "last_name", "balance", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "a"], ["last_name", "a"], ["balance", 10.0], ["created_at", 2017-03-31 12:39:39 UTC], ["updated_at", 2017-03-31 12:39:39 UTC]]

  def show
    @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @account = Account.find(params[:id])

    if @account.update(account_params)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "accounts" SET "first_name" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["first_name", "b"], ["updated_at", 2017-03-30 18:28:49 UTC], ["id", 1]]

  def destroy
    @account = Account.find(params[:id])
    @account.destroy
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "accounts" WHERE "accounts"."id" = ?  [["id", 1]]

  def balance
    @account = Account.find(params[:id])
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]