src/app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("sender_id", "recipient_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sender_id", 1], ["recipient_id", 4], ["amount", 11.0], ["created_at", 2017-03-31 12:40:16 UTC], ["updated_at", 2017-03-31 12:40:16 UTC]]
---
  def create
    @transaction = Transaction.new(transaction_params)

    if @transaction.save

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @transaction = Transaction.find(params[:id])

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "transactions" SET "recipient_id" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["recipient_id", 2], ["updated_at", 2017-03-31 12:40:40 UTC], ["id", 4]]
---
  def update
    @transaction = Transaction.find(params[:id])

    if @transaction.update(transaction_params)

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 3]]
---
  def destroy
    @transaction = Transaction.find(params[:id])
    @transaction.destroy

SELECT "transactions".* FROM "transactions" WHERE "transactions"."sender_id" = ?  [["sender_id", 1]]
SELECT COUNT(*) FROM "transactions" WHERE "transactions"."sender_id" = ?  [["sender_id", 1]]
---
  def sender
    @transactions = Transaction.where(sender_id: params[:id])
    puts @transactions.size

SELECT "transactions".* FROM "transactions" WHERE "transactions"."recipient_id" = ?  [["recipient_id", 1]]
---
  def recipient
    @transactions = Transaction.where(recipient_id: params[:id])

SELECT "transactions".* FROM "transactions" WHERE ("transactions"."recipient_id" = ? OR "transactions"."sender_id" = ?)  [["recipient_id", 1], ["sender_id", 1]]
---
  def account
    @transactions = Transaction.where(recipient_id: params[:id]).or(Transaction.where(sender_id: params[:id]))

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def amount
    @transaction = Transaction.find(params[:id])